# Core desktop
niri
xwayland-satellite
xdg-desktop-portal
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk
waybar
fuzzel
mako
kitty
swaybg
awww
swaylock
swayidle
polkit-gnome

# Daily desktop utilities
wl-clipboard
cliphist
grim
slurp
brightnessctl
playerctl
pavucontrol
nautilus
thunar
thunar-volman
thunar-archive-plugin
gvfs
gvfs-smb
sshfs
firefox
wlogout
nwg-look
inkscape
gimp
imv
loupe
imagemagick
mpv
file-roller
zathura
zathura-pdf-mupdf
keepassxc
baobab
syncthing
qalculate-gtk
gnome-disk-utility
libreoffice-fresh

# Shell / CLI
zsh
git
github-cli
curl
jq
ripgrep
fd
fzf
lf
mc
btop
fastfetch
file
mediainfo
bat

# C++ development
neovim
base-devel
clang
clang-tools-extra
cmake
ninja
gdb
lldb

# Gaming
steam
steam-devices
gamescope
gamemode
mangohud

# Fonts / visuals
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols
noto-fonts
noto-fonts-emoji
papirus-icon-theme
adw-gtk-theme
adwaita-cursors
